Core/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>БланкДоговора</name>
    <type>
      <types>CatalogRef.БланкиДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыПоставщику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияДнейДоВыставленияДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияМесяцевДоВыставленияДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияПериодичность</name>
    <type>
      <types>EnumRef.БиллингПериодичностьДоговораОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОбслуживанияТарифныйПлан</name>
    <type>
      <types>CatalogRef.ТарифныеПланыДоговоровОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТорговойТочки</name>
    <type>
      <types>CatalogRef.ОПТИМУС_ВидыТорговыхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоговорОбслуживания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТорговойТочки</name>
    <type>
      <types>CatalogRef.ОПТИМУС_КатегорииТорговыхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйПредставитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНДФЛ</name>
    <type>
      <types>CatalogRef.ТипыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Понедельник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вторник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Четверг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пятница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Суббота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Воскресенье</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйЛимитЗадолженностиОтПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyСчетПенсионногоНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyУдерживатьПенсионныйНалог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpНачислятьНДФЛПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpНДФЛСВыплат</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpПроцентСтавкиПодоходногоНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpТипНалогообложенияНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpУдерживатьПодоходныйНалог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорОбслуживанияПолучателиРассылки</name>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РедактируемыеПараметры</name>
    <attributes>
      <name>СсылкаБланка</name>
      <type>
        <types>CatalogRef.БланкиДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИнфобазы</name>
    <attributes>
      <name>СсылкаБланка</name>
      <type>
        <types>CatalogRef.БланкиДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>EnumRef.ПараметрыБланковДоговоровСКонтрагентами</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПосещения</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыСкидокНаценок</name>
    <attributes>
      <name>ВидСкидкиНаценки</name>
      <type>
        <types>CatalogRef.ВидыСкидокНаценок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ) // Kuzmich, 12.08.2019, Использовать виды договоров
	Если Константы_ИспользоватьВидыДоговоров_Получить() Тогда
		Если ТипЗНЧ(ВладелецФормы)=Тип("ПолеФормы") Тогда
			УстановитьДополнительныйОтборПоВидуДоговора();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КонтролироватьВыборДоговора", КонтролироватьВыборДоговора);
	Параметры.Свойство("Организация"  , Организация);
	Параметры.Свойство("Контрагент"   , Контрагент);
	Параметры.Свойство("ВидыДоговоров", ВидыДоговоров);
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов() Тогда
		Элементы.СписокОрганизация.Видимость = Ложь;
		КонтролироватьСоответствиеДокументу = Ложь;
	Иначе
		КонтролироватьСоответствиеДокументу = КонтролироватьВыборДоговора;
	КонецЕсли;
	
	УстановитьОтборИУсловноеОформление();
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ГруппаПодменюПечать);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекстВопроса = "";
	Если Не ПроверитьСоответствиеДоговораУсловиямДокумента(КонтролироватьСоответствиеДокументу, ТекстВопроса, Значение, Организация, Контрагент, ВидыДоговоров) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВопроса = Новый Структура;
		ПараметрыВопроса.Вставить("Значение", Значение);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокВыборЗначенияЗавершение", ЭтотОбъект, ПараметрыВопроса);
		ТекстВопроса = ТекстВопроса + НСтр("ka='ავირჩიოთ სხვა ხელშეკრულება?';ru='"
""
"Выбрать другой договор?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОповеститьОВыборе(ДополнительныеПараметры.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если КонтролироватьВыборДоговора
		И ЗначениеЗаполнено(Контрагент)
		И ЗначениеЗаполнено(Организация)
		И ВидыДоговоров.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		ДанныеЗаполненияДоговора = Новый Структура;
		ДанныеЗаполненияДоговора.Вставить("Владелец", Контрагент);
		ДанныеЗаполненияДоговора.Вставить("Организация", Организация);
		ДанныеЗаполненияДоговора.Вставить("ВидДоговора", ВидыДоговоров[0].Значение);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполненияДоговора);
		
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает отбор и условное оформление списка, если у контрагента установлен признак ведения расчетов по договорам.
//
&НаСервере
Процедура УстановитьОтборИУсловноеОформление()
	
	СписокУдаляемыхЭлементов = Новый СписокЗначений;
	Для каждого ЭлементУсловногоОформления Из Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный"
			И ЭлементУсловногоОформления.Представление = "Не соответствуют условиям документа" Тогда
			СписокУдаляемыхЭлементов.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент Из СписокУдаляемыхЭлементов Цикл
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Удалить(Элемент.Значение);
	КонецЦикла;
	
	Если Не КонтролироватьВыборДоговора Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список,"Владелец",Параметры.Контрагент);
	
	Если Не КонтролироватьСоответствиеДокументу Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементУсловногоОформления = Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	
	ГруппаИЛИ = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаИЛИ.Использование = Истина;
	
	ЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Организация;
	
	ЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДоговора");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = ВидыДоговоров;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСерый);
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный";
	ЭлементУсловногоОформления.Представление = "Не соответствуют условиям документа";
	
КонецПроцедуры

// Проверяет соответствие реквизитов договора "Организация" и "ВидДоговора" переданным параметрам.
//
&НаСервереБезКонтекста
Функция ПроверитьСоответствиеДоговораУсловиямДокумента(КонтролироватьСоответствиеДокументу, ТекстСообщения, Договор, Организация, Контрагент, СписокВидовДоговора)
	
	Если Не КонтролироватьСоответствиеДокументу Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ДоговорСоответствуетУсловиямДокумента(ТекстСообщения, Договор, Организация, Контрагент, СписокВидовДоговора);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список.ТекущиеДанные);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

// Kuzmich, 12.08.2019, Использовать виды договоров
&НаСервере
Функция Константы_ИспользоватьВидыДоговоров_Получить()
	Возврат Константы.ИспользоватьВидыДоговоров.Получить();
КонецФункции // ()

&НаКлиенте
Процедура УстановитьДополнительныйОтборПоВидуДоговора()
	
	ДанныеВызывающегоОбъекта = Новый Структура("СсылкаНаДокумент,ТаблицаФормы,ИмяРеквизита");
	
	ТекСсылкаНаВызывающийОбъект = НЕОПРЕДЕЛЕНО;
	ТекТаблицаФормы = "";
	Если ТипЗНЧ(ВладелецФормы)=Тип("ПолеФормы") Тогда
		
		ДанныеВызывающегоОбъекта.ИмяРеквизита = ВладелецФормы.Имя;
		Попытка
			ДанныеВызывающегоОбъекта = ПолучитьДанныеВызывающегоОбъекта(ВладелецФормы,ДанныеВызывающегоОбъекта);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	ТекСсылкаНаВызывающийОбъект = ДанныеВызывающегоОбъекта.СсылкаНаДокумент;
	ТекТаблицаФормы = ДанныеВызывающегоОбъекта.ТаблицаФормы;	
	
	Если НЕ ТекСсылкаНаВызывающийОбъект = НЕОПРЕДЕЛЕНО Тогда
		
		ВладелецВсеНеУстановлены = ИСТИНА;
		
		ВладелецПокупатель = ИСТИНА;
		ВладелецПоставщик = ИСТИНА;
		ВладелецПрочиеОтношения = ИСТИНА;
		
		Если ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ВводНачальныхОстатков") Тогда
			Если ТекТаблицаФормы="ЗапасыПереданные" ИЛИ ТекТаблицаФормы="ЗапасыПринятые" Тогда
				Возврат;
			ИначеЕсли ТекТаблицаФормы="РасчетыСПоставщиками" Тогда
				ВладелецПокупатель = ЛОЖЬ;
				ВладелецПоставщик = ИСТИНА;
				ВладелецПрочиеОтношения = ИСТИНА;
			ИначеЕсли ТекТаблицаФормы="РасчетыСПокупателями" Тогда
				ВладелецПокупатель = ИСТИНА;
				ВладелецПоставщик = ЛОЖЬ;
				ВладелецПрочиеОтношения = ИСТИНА;
			Иначе
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.Взаимозачет") Тогда
			Если ТекТаблицаФормы="Кредитор" Тогда
				ВладелецПокупатель = ЛОЖЬ;
				ВладелецПоставщик = ИСТИНА;
				ВладелецПрочиеОтношения = ИСТИНА;
			ИначеЕсли ТекТаблицаФормы="Дебитор" Тогда
				ВладелецПокупатель = ИСТИНА;
				ВладелецПоставщик = ЛОЖЬ;
				ВладелецПрочиеОтношения = ИСТИНА;
			Иначе
				ВладелецПокупатель = ИСТИНА;
				ВладелецПоставщик = ИСТИНА;
				ВладелецПрочиеОтношения = ИСТИНА;
			КонецЕсли;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ЗаданиеНаРаботу") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
			//ВладелецПокупатель = ИСТИНА;
			//ВладелецПоставщик = ИСТИНА;
			//ВладелецПрочиеОтношения = ИСТИНА;
			Возврат;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ОтчетОПереработке") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПередачаВА") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПоступлениеДСПлан") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
			Возврат;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПриходныйОрдер") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ПрочиеРасходы") Тогда
			Возврат;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.РасходДСПлан") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.РасходИзКассы") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.РасходСоСчета") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.СверкаВзаиморасчетов") Тогда
			Возврат;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.СчетНаОплату") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.СчетФактура") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.УчетВремени") Тогда
			Возврат;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.СчетФактураОтправленныйГрузия") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.СчетФактураПолученныйГрузия") Тогда
			ВладелецПокупатель = ЛОЖЬ;
			ВладелецПоставщик = ИСТИНА;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.Визит") Тогда
			Возврат;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ЗаказНаВозврат") Тогда
			ВладелецПокупатель = ИСТИНА;
			ВладелецПоставщик = ЛОЖЬ;
			ВладелецПрочиеОтношения = ИСТИНА;
		ИначеЕсли ТипЗНЧ(ТекСсылкаНаВызывающийОбъект)=Тип("ДокументСсылка.ВозвратДенегОтПФ") Тогда
			Возврат;
		КонецЕсли;
		
		Если ВладелецПокупатель ИЛИ ВладелецПоставщик ИЛИ ВладелецПрочиеОтношения Тогда
		
			ГруппаОтбораИЛИ = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
			ГруппаОтбораИЛИ.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			
			Если ВладелецПокупатель Тогда
				ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Покупатель");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.Использование = ИСТИНА;
				ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
				ЭлементОтбора.ПравоеЗначение = ВладелецПокупатель;
			КонецЕсли;
			
			Если ВладелецПоставщик Тогда
				ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Поставщик");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.Использование = ИСТИНА;
				ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
				ЭлементОтбора.ПравоеЗначение = ВладелецПоставщик;
			КонецЕсли;
			
			Если ВладелецПрочиеОтношения Тогда
				ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ПрочиеОтношения");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.Использование = ИСТИНА;
				ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
				ЭлементОтбора.ПравоеЗначение = ВладелецПрочиеОтношения;
			КонецЕсли;
			
			//Если ВладелецВсеНеУстановлены Тогда
			//	
			//	ГруппаОтбораВсеНеУстановлены = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			//	ГруппаОтбораВсеНеУстановлены.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			//	ГруппаОтбораВсеНеУстановлены.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			//	
			//	ЭлементОтбора = ГруппаОтбораВсеНеУстановлены.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Покупатель");
			//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			//	ЭлементОтбора.Использование = ИСТИНА;
			//	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			//	ЭлементОтбора.ПравоеЗначение = ЛОЖЬ;
			//	
			//	ЭлементОтбора = ГруппаОтбораВсеНеУстановлены.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ПрочиеОтношения");
			//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			//	ЭлементОтбора.Использование = ИСТИНА;
			//	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			//	ЭлементОтбора.ПравоеЗначение = ЛОЖЬ;
			//	
			//	ЭлементОтбора = ГруппаОтбораВсеНеУстановлены.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ПрочиеОтношения");
			//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			//	ЭлементОтбора.Использование = ИСТИНА;
			//	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			//	ЭлементОтбора.ПравоеЗначение = ЛОЖЬ;				
			//	
			//КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВызывающегоОбъекта(ЭлементФормы,ДанныеВызывающегоОбъекта)
	ПЕРЕМ РЕЗ;
	РЕЗ = ДанныеВызывающегоОбъекта;
	
	Если ТипЗНЧ(ЭлементФормы)=Тип("УправляемаяФорма") Тогда
		РЕЗ.СсылкаНаДокумент = ЭлементФормы.Объект.Ссылка;
	ИначеЕсли ТипЗНЧ(ЭлементФормы)=Тип("ТаблицаФормы") Тогда
		РЕЗ.ТаблицаФормы = ЭлементФормы.Имя; 
		РЕЗ = ПолучитьДанныеВызывающегоОбъекта(ЭлементФормы.Родитель,РЕЗ);
	Иначе	
		РЕЗ = ПолучитьДанныеВызывающегоОбъекта(ЭлементФормы.Родитель,РЕЗ);
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции // ()
// Kuzmich, 12.08.2019, Использовать виды договоров
